<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Αρχική σελίδα</title>
    <link rel="stylesheet" href="styles.css">
</head>
<body>
    
    <div id="box1"><h1 >Αρχική σελίδα</h1></div>
    <div id="container">
        <div id="box2"><nav>
            <ul>
                <li><a href="index_tutor.php">Αρχική σελίδα</a></li>
                <li><a href="announcement_tutor.php">Ανακοινώσεις</a></li>
                <li><a href="communication_tutor.php">Επικοινωνία</a></li>
                <li><a href="documents_tutor.php">Έγραφα μαθήματος</a></li>
                <li><a href="homework_tutor.php">Εργασίες</a></li>
            </ul>
        </nav>
    </div>
        <div id="box3"><p>Καλώς ήρθατε στο μάθημα Βασικές Αρχές Προγραμματισμού!</p>
            <p>Το μάθημα έχει ως στόχο την κατανόηση των βασικών αρχών και εννοιών του δομημένου προγραμματισμού (μεταβλητές, δομές, εντολές ελέγχου & επανάληψης, συναρτήσεις). Οι φοιτητές θα αποκτήσουν δεξιότητες με την χρήση ολοκληρωμένων εργαλείων για την ανάπτυξη, αποσφαλμάτωση και εκτέλεση προγραμμάτων.</p>
            <p>Η γλώσσα προγραμματισμού που θα χρησιμοποιηθεί είναι η Python.</p>
            <p>Η ιστοσελίδα του μαθήματος περιέχει τα εξής:</p>
            <p>1.Ανακοινώσεις: Όλες οι ενημερώσεις από τον καθηγητή, προκειμένου να ενημερώνει τους φοιτητές για οποιαδήποτε σημαντική πληροφορία ή εξέλιξη σχετικά με το μάθημα.</p>
            <p>2.Επικοινωνία: Όλα τα στοιχεία επικοινωνίας του καθηγητή. Οι φοιτητές μπορούν να επικοινωνήσουν μαζί του μέσω email για οποιαδήποτε ερώτηση ή απορία.</p>
            <p>3.Έγραφα Μαθήματος: Όλα τα απαραίτητα έγγραφα που σχετίζονται με το μάθημα. Οι φοιτητές μπορούν να κατεβάσουν το υλικό που χρειάζονται για την προετοιμασία τους.</p>
            <p>4.Εργασίες: Οδηγίες και εκφωνήσεις για τις εργασίες που αναμένεται να εκπονήσουν οι φοιτητές.</p>
            <img src="vap.jpg" alt="Vap" style="width:600px;height:300px;"></div>
    </div>

</body>

</html>
